## Searching and Filtering

#### KQL queries from the Searching and Filtering section of chapter 1 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Using search operator example
```KQL
search “deviceinfo”
```

##### Using the distinct operator
```KQL
search "deviceinfo"
|distinct $table  
```

#### Using search operator example
```KQK
search "browser"
```

##### Using the search operator on a specific table
```KQL
search in (SigninLogs) “browser”
```

##### Using the take operator
```KQL
SigninLogs
| take 5  
```

##### Using the where operator
```KQL
SigninLogs
| where  ResultType == 50126
```

##### Using the where operator not equal
```KQL
SigninLogs
| where  ResultType != 50126
```
##### MSFT Employee Contribution-Laura Hutchcroft
##### Looking for failed sign-in events. The query below helps monitor for failed sign-in events in the last 24 hours. Frequent failures can indicate an adversary trying to gain unauthorized access. These should be investigated and understood. 

```KQL
SigninLogs
| where TimeGenerated > ago(24h)
| where ResultType !in ("0", "50125", "50140")
```

##### Using the where operator with strings
```KQL
SigninLogs
| where ConditionalAccessStatus == "Success" 
```

##### Using the where operator withy strings
```KQL
SigninLogs
| where ConditionalAccessStatus =~ "Success"  
```

##### Using the where operator with strings
```KQL
SigninLogs
| where ConditionalAccessStatus !~ "Success"
```

##### Using the has operator
```KQL
SigninLogs
| where UserAgent has “Edge”  
```

##### Using the has operator
```KQL
SigninLogs
| where UserAgent !has “Edge”
```

##### MSFT Employee Contribution-Michael Barbush
##### Antivirus Exclusions. These three queries below are used to look for if any exclusions have been added or attempted to be added for extensions, paths or processes for the last 24 hours.

```KQL
DeviceRegistryEvents
| where RegistryKey has @"Exclusions\Extensions" and ActionType in ("RegistryValueDeleted","RegistryKeyDeleted","RegistryKeyCreated","RegistryValueSet","RegistryKeyRenamed") and Timestamp > ago(24h)
| sort by Timestamp
```

```KQL
DeviceRegistryEvents
| where RegistryKey has @"Exclusions\Paths" and ActionType in ("RegistryValueDeleted","RegistryKeyDeleted","RegistryKeyCreated","RegistryValueSet","RegistryKeyRenamed") and Timestamp > ago(24h)
| sort by Timestamp
```

```KQL
DeviceRegistryEvents
| where RegistryKey has @"Exclusions\Processes" and ActionType in ("RegistryValueDeleted","RegistryKeyDeleted","RegistryKeyCreated","RegistryValueSet","RegistryKeyRenamed") and Timestamp > ago(24h)
| sort by Timestamp
```

##### Using the has_cs operator
```KQL
SigninLogs
| where UserAgent has_cs "Edge" 
```

##### Using the has_cs operator
```KQL
SigninLogs
| where UserAgent !has_cs "Edge" 
```

##### Using the contains operator
```KQL
SigninLogs
| where UserAgent contains “HroM”
```

##### MSFT Employee Contribution-Laura Hutchcroft
##### Monitoring KeyVault secret operations. The query below helps monitor for all secret operations over the last 24 hours. Frequent secret operations could indicate an adversary trying to steal sensitive information. These should be investigated and understood.

```KQL
AzureDiagnostics
| where TimeGenerated > ago(24h)
| where ResourceProvider == "MICROSOFT.KEYVAULT"
| where Category == "AuditEvent"
| where OperationName contains "secret"
```

##### Using the has_any operator
```KQL
SigninLogs
| where AppDisplayName has_any ("Azure Portal", "Graph Explorer")
```

##### Using the in operator
```KQL
SigninLogs
| where AppDisplayName in ("Azure Portal", "Graph Explorer") 
```

##### Using the in operator
```KQL
SigninLogs
| where AppDisplayName in ("Azure", "Graph Explorer")     
```

##### Using the has_any operator
```KQL
SigninLogs
| where AppDisplayName has_any ("Azure", "Graph Explorer")
```

##### Using the startswith operator
```KQL
SigninLogs
| where AppDisplayName startswith ("Gra")
```

##### Using the startswith operator
```KQL
SigninLogs
| where AppDisplayName startswith ("Exp")
```

##### Using the hasprefix operator
```KQL
SigninLogs
| where AppDisplayName hasprefix ("Exp")
```

##### Using the project operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
| project AppDisplayName, Location, UserAgent
```

##### Using the project-rename operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
| project AppDisplayName, Location, UserAgent
| project-rename Application = AppDisplayName
```

##### Using the project-reorder operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
| project AppDisplayName, Location, UserAgent
| project-rename Application = AppDisplayName
| project-reorder Location, Application, UserAgent
```

##### Using the where operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
```

##### Using the project-away operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
| project-away ResourceId, OperationName, OperationVersion, Category
```

##### Using the extend operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
| project TimeGenerated, CreatedDateTime
| extend Duration = TimeGenerated – CreatedDateTime
```

##### Using the strlen function
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
| project ResultDescription
| extend strlen(ResultDescription)
```


##### Using the extend operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "success"
| extend Calculation = 1906 * 1917 * 2005
| extend MadeUpdata = "Winners!"
```

##### MSFT Employee Contribution-Rudnei Oliveira
##### PowerShell or bash commands executed in Azure Cloud Shell. The query below will identify if any user started using Azure Cloud Shell to execute PowerShell or bash commands. If unexpected users are found, it should be further investigated.

```KQL
AzureActivity
| where CategoryValue == "Administrative"
| where OperationNameValue == "MICROSOFT.STORAGE/STORAGEACCOUNTS/WRITE"
| where ResourceGroup contains "CLOUD-SHELL-STORAGE"
| extend storageaccname = tostring(parse_json(Properties).resource)
| project OperationNameValue, Caller, CallerIpAddress, ResourceGroup
```