## Data Manipulation

#### KQL queries from the Data Manipulation section of chapter 1 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Using Sort By and Order By default example
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied"
| project AppDisplayName, Location, UserAgent
```

##### Using Sort by defaults
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied"
| project AppDisplayName, Location, UserAgent
| sort by AppDisplayName 
```

##### Using Sort multiple columns
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied"
| project AppDisplayName, Location, UserAgent
| sort by AppDisplayName desc, Location asc
```

##### MSFT Employee Contribution-Bailey Bercik
##### Drilling into Microsoft Entra ID Governance. These queries below are helpful as an administrator to determine usage patterns in access reviews.  This can be helpful for seeing how frequently these requests are being created and whether the admin can proactively assign these resources in a better way. Perhaps patterns on which types of users requesting access will emerge or seeing whether a particular user is inundated with review requests. The second is helpful if an administrator  wants to see whether access requests were approved or denied by reviewers. Justification and target resources will also be shown to give the administrator  more information. Finally, if an administrator wants to see which access requests expired. Perhaps to know whether requests should be rerouted to another user for approval instead. 
```KQL
AuditLogs
| where LoggedByService == "Access Reviews"
| where OperationName == "Create request"
| order by TimeGenerated asc
```
```KQL
AuditLogs
| where LoggedByService == "Access Reviews"
| where OperationName == "Request approved" or OperationName == "Request denied"
| order by TimeGenerated asc
```

```KQL
AuditLogs
| where LoggedByService == "Access Reviews"
| where OperationName == "Request expired"
| order by TimeGenerated asc
```

##### Using Sort with nulls
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied" and isnotempty(UserAgent)
| project AppDisplayName, Location, UserAgent
| sort by UserAgent 
```

##### Using the top operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied"
| top 100 by TimeGenerated desc
| project TimeGenerated, AppDisplayName, Location, UserAgent
| sort by Location
```

##### Using the split operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied"
| project ResourceId
| extend ResourceIDSubString = split(ResourceId, "/") 
```

##### Using the split operator
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied"
| project ResourceId
| extend ResourceIDSubString = split(ResourceId, "/", 2)   
```

##### MSFT Employee Contribution-Michael Epping
##### Looking for iOS and macOS SSO Extension usage. The query below will get a summary of sign-ins facilitated by the iOS and/or macOS SSO Extension deployed via MDM provider. This helps the administrator determine if the SSO Extension is working as expected for those users. This is recommended to be deployed for all Apple devices. 
```KQL
AADNonInteractiveUserSignInLogs
| where TimeGenerated > ago(30d)
| extend operatingSystem = parse_json(DeviceDetail).operatingSystem
| where operatingSystem == "MacOs" or operatingSystem == "Ios"
| where UserAgent startswith "Mac%20SSO%20Extension" or UserAgent startswith "AuthenticatorSSOExtension"
| summarize count() by UserPrincipalName, tostring(operatingSystem)
| sort by count_
```
