## Just Enough User Interface

#### KQL queries from the Just Enough User Interface section of chapter 1 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Returning results so we can manipulate data in the UI.
```KQL
SigninLogs
| where ConditionalAccessStatus == "notApplied"
```
