## Time Operators

#### KQL queries from the Time Operators section of chapter 1 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Using the ago operator
```KQL
SigninLogs
| where TimeGenerated > ago(7d) 
```

##### Using the ago operator
```KQL
SigninLogs
| where TimeGenerated > ago(15m) 
```

##### Using the between operator
```KQL
SigninLogs
| where TimeGenerated between (datetime(2023-09-21) .. datetime(2023-09-23)) 
```

##### Using the between operator
```KQL
SigninLogs
| where TimeGenerated between (ago(14d) .. ago(7d))
```

##### Using the now function
```KQL
SigninLogs
| where TimeGenerated between (ago(14d) .. ago(7d))
| extend HowLongAgo = ( now() - TimeGenerated)
```

##### Using the datetime_utc_to_local function
```KQL
SigninLogs
| extend LocalTimeInTokyo = datetime_utc_to_local(now(), 'Asia/Tokyo')
```

##### Using the datetime_part function
```KQL
print datetime_part("week_of_year", now())
```