## Min, Max, Average and Sum

#### KQL queries from the Min, Max, Average and Sum section of chapter 2 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required

##### Using the min function
```KQL
SigninLogs
| where TimeGenerated > ago (14d)
| summarize TotalCount = count(), FirstEvent=min(TimeGenerated) by AppDisplayName
| sort by FirstEvent asc
```

##### Using the max function
```KQL
SigninLogs
| where TimeGenerated > ago (14d)
| summarize TotalCount = count(), LastEvent=max(TimeGenerated) by AppDisplayName
| sort by LastEvent desc
```

##### Using the min and max functions together for side by side time view
```KQL
SigninLogs
| where TimeGenerated > ago (14d)
| summarize TotalCount = count(), FirstEvent = min(TimeGenerated), LastEvent=max(TimeGenerated) by AppDisplayName
| project AppDisplayName, TotalCount, FirstEvent, LastEvent
| sort by FirstEvent asc, LastEvent desc
```

##### Using the arg_min function
```KQL
SigninLogs
| where TimeGenerated > ago (14d)
| summarize FirstEvent = arg_min(TimeGenerated, ConditionalAccessStatus, ClientAppUsed, AuthenticationRequirement) by AppDisplayName
| sort by FirstEvent asc 
```

##### Using the arg_max function
```KQL
SigninLogs
| where TimeGenerated > ago (14d)
| summarize LastEvent = arg_max(TimeGenerated, *) by AppDisplayName
| sort by LastEvent desc
```

##### Using the avg function
```KQL
SigninLogs
| where TimeGenerated > ago (14d)
| summarize AvgCreatedTime = avg(CreatedDateTime)by AppDisplayName
```
##### Using the avgif function
```KQL
SigninLogs
| where TimeGenerated > ago (14d)
| summarize AvgCreatedTime = avgif(CreatedDateTime, Location == "US")by AppDisplayName
```

##### MSFT Employee Contribution-Laura Hutchcroft
##### Monitoring IaaS Virtual Machines. This query looks at common performance metrics for virtual machines to help you look at resource consumption and if the virtual machines are sized correctly.
```KQL
Perf
| where TimeGenerated > ago(1h)
| where (ObjectName == "Processor" and CounterName == "% Processor Time") or 
        (ObjectName == "Memory" and CounterName == "Available MBytes")
| summarize avg(CounterValue) by Computer, CounterName
```

##### Using the sum function
```KQL
AppPerformanceCounters
| where  TimeGenerated > ago(14d)
| summarize sum(Value) by AppRoleName, Name
```