## Aggregation Functions Usage in Other Operators

#### KQL queries from the Aggregation Functions Usage in Other Operators section of chapter 2 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Using the top-nested function
```KQL
SigninLogs
| where TimeGenerated > ago(14d)
| top-nested 3 of AppDisplayName by count(), top-nested 3 of UserAgent by count()
| project AppDisplayName, UserAgent
```
