## Cybersecurity-focused Operators

#### KQL queries from the Cybersecurity-focused Operators section of chapter 5 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Example log data to understand how the 'has' operator works
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log

```

##### Searches for '3389' using has in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has "3389"
```

##### Searches for 'temp' using has in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has "temp"
```

##### Searches for 'TEMP' using has in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has "TEMP"
```

##### Searches for '4444' or 'wincmd' using has_any in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has_any ("4444","wincmd")
```

##### Searches for '4444' or 'wincmd' using has_any in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has_any ("4444","wincmd")
```

##### Searches for 'eric' or '8080' using has_any in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has_any ("eric","8080")
```

##### Searches for '4444' and 'wincmd' using has_all in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has_all ("4444","wincmd")
```

##### Searches for 'wincmd' and '3389' using has_all in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data has_all ("wincmd","3389")
```

##### Searches for records that don't have '3389' using !has in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data !has "3389"
```

##### Searches for records that don't have '3389' or 'cassie' using not and has_any in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where not(data has_any ("3389","cassie"))
```

##### Searches for records that don't have 'cassie' and 'wincmd' using not and has_all in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where not(data has_all ("cassie","wincmd"))
```

##### Searches for records that have 'Des' using contains in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data contains "Des"
```

##### Searches for records that don't have 'Des' using !contains in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data !contains "Des"
```

##### Searches for records that have '4444' or 'wincmd' or 'cassie' using contains in the sample data
```KQL
let Log=datatable (data:string)['SourceIP:10.10.45.55 SourcePort:8080 DestinationIP:50.50.50.50 DestinationPort:4444 Process:c:\\ProgramData\\Temp\\test1.exe User:CONTOSO\\eric.lang',
'SourceIP:10.10.3.100 SourcePort:3389 DestinationIP:20.20.20.20 DestinationPort:3389 Process:c:\\ProgramData\\Temp\\wincmd.exe User:CONTOSO\\cassie.hicks'];
Log
| where data contains "4444" or data contains "wincmd" and data contains "cassie"
```

##### Example sign-in data to demonstrate additional operators
```KQL
let Log=datatable (IPAddress:string,Application:string,User:string)["20.20.20.20","OfficeHome","eric.lang@contoso.com",
"50.50.50.50","OfficeHome","cassie.hicks@contoso.com","70.70.70.70","MyPayroll","sunil.kasturi@contoso.com","90.90.90.90","SharePoint","tina.makovec@contoso.com"];
Log
```

##### Searches for 'tina.makovec@contoso.com' using == in the sample data
```KQL
let Log=datatable (IPAddress:string,Application:string,User:string)["20.20.20.20","OfficeHome","eric.lang@contoso.com",
"50.50.50.50","OfficeHome","cassie.hicks@contoso.com","70.70.70.70","MyPayroll","sunil.kasturi@contoso.com","90.90.90.90","SharePoint","tina.makovec@contoso.com"];
Log
| where User == "tina.makovec@contoso.com"
```

##### Searches for '50.50.50.50' using == in the sample data
```KQL
let Log=datatable (IPAddress:string,Application:string,User:string)["20.20.20.20","OfficeHome","eric.lang@contoso.com",
"50.50.50.50","OfficeHome","cassie.hicks@contoso.com","70.70.70.70","MyPayroll","sunil.kasturi@contoso.com","90.90.90.90","SharePoint","tina.makovec@contoso.com"];
Log
| where IPAddress == "50.50.50.50"
```

##### Searches for records that aren't '20.20.20.20' using != in the sample data
```KQL
let Log=datatable (IPAddress:string,Application:string,User:string)["20.20.20.20","OfficeHome","eric.lang@contoso.com",
"50.50.50.50","OfficeHome","cassie.hicks@contoso.com","70.70.70.70","MyPayroll","sunil.kasturi@contoso.com","90.90.90.90","SharePoint","tina.makovec@contoso.com"];
Log
| where IPAddress != "20.20.20.20"
```

##### Searches for '50.50.50.50' or '90.90.90.90' using 'in' in the sample data
```KQL
let Log=datatable (IPAddress:string,Application:string,User:string)["20.20.20.20","OfficeHome","eric.lang@contoso.com",
"50.50.50.50","OfficeHome","cassie.hicks@contoso.com","70.70.70.70","MyPayroll","sunil.kasturi@contoso.com","90.90.90.90","SharePoint","tina.makovec@contoso.com"];
Log
| where IPAddress in ("50.50.50.50","90.90.90.90")
```

##### Searches for records other than '50.50.50.50' or '90.90.90.90' using '!in' in the sample data
```KQL
let Log=datatable (IPAddress:string,Application:string,User:string)["20.20.20.20","OfficeHome","eric.lang@contoso.com",
"50.50.50.50","OfficeHome","cassie.hicks@contoso.com","70.70.70.70","MyPayroll","sunil.kasturi@contoso.com","90.90.90.90","SharePoint","tina.makovec@contoso.com"];
Log
| where IPAddress !in ("50.50.50.50","90.90.90.90")
```

##### Finds the last 10 days of logs using ago() - no sample data for this, just an example 
```KQL
SigninLogs
| where TimeGenerated > ago(10d)
```

##### Finds the last 10 days of logs using ago() - no sample data for this, just an example 
```KQL
SigninLogs
| where TimeGenerated > ago(10d)
```

##### Finds the last 25 minutes of logs using ago() - no sample data for this, just an example 
```KQL
SigninLogs
| where TimeGenerated > ago(25m)
```

##### Finds the last 45 seconds of logs using ago() - no sample data for this, just an example 
```KQL
SigninLogs
| where TimeGenerated > ago(45s)
```

##### Finds events between 14 days and 7 days ago using ago() - no sample data for this, just an example 
```KQL
SigninLogs
| where TimeGenerated > ago (14d) and TimeGenerated < ago(7d)
```

##### Finds events between two specific timestamps using datetime() - no sample data for this, just an example 
```KQL
SigninLogs
| where TimeGenerated between (datetime(07-01-2023 07:00:00) .. datetime(07-05-2023 15:00:00))
| where UserPrincipalName == "eric.lang@contoso.com"
```

##### Example log data to understand abs()
```KQL
let Log=datatable (Event1:datetime,Event2:datetime,IPAddress:string,Application:string,User:string)["2023-07-18 07:23:25.299","2023-07-25 14:33:05.345","20.20.20.20","OfficeHome","eric.lang@contoso.com"];
Log
```

##### Calculating the time between two events using abs()
```KQL
let Log=datatable (Event1:datetime,Event2:datetime,IPAddress:string,Application:string,User:string)["2023-07-18 07:23:25.299","2023-07-25 14:33:05.345","20.20.20.20","OfficeHome","eric.lang@contoso.com"];
Log
| extend TimeDelta=abs(Event2-Event1)
```

##### Calculating the time between two events in days using datetime_diff()
```KQL
let Log=datatable (Event1:datetime,Event2:datetime,IPAddress:string,Application:string,User:string)["2023-07-18 07:23:25.299","2023-07-25 14:33:05.345","20.20.20.20","OfficeHome","eric.lang@contoso.com"];
Log
| extend TimeDelta=datetime_diff("day",Event2,Event1)
```

##### Calculating the time between two events in minutes using datetime_diff()
```KQL
let Log=datatable (Event1:datetime,Event2:datetime,IPAddress:string,Application:string,User:string)["2023-07-18 07:23:25.299","2023-07-25 14:33:05.345","20.20.20.20","OfficeHome","eric.lang@contoso.com"];
Log
| extend TimeDelta=datetime_diff("minute",Event2,Event1)
```

##### Example log data to understand data summation
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
"2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
"2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
"2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
"2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
"2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
"2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
"2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
"2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
"2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
"2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
```

##### Counting how many records with count()
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| count
```

##### Counting how many records for each user with count() by
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize count() by User
```

##### Counting how many records for each user and IPAddress with count() by
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize count() by User, IPAddress
```

##### Distinct counting users with dcount()
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize dcount(User)
```

##### Distinct counting users by IPAddress with dcount() by
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize dcount(User) by IPAddress
```

##### Creating a list of applications with make_list()
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize make_list(Application)
```

##### Creating a list of applications per user with make_list() by
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize make_list(Application) by User
```

##### Creating a set of applications with make_set()
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize make_set(Application)
```

##### Creating a set of applications per user with make_set() by
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize make_set(Application) by User
```

##### Finding the latest timestamp with max()
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize max(Timestamp)
```

##### Finding the latest timestamp per user with max() by
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize max(Timestamp) by User
```

##### Finding the latest record with arg_max()
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize arg_max(Timestamp, *)
```

##### Finding the latest record per user with arg_max() by
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize arg_max(Timestamp, *) by User
```

##### Total count and distinct count of apps per user with combined summation operators
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize TotalCount=count(), DistinctApps=dcount(Application) by User
```

##### First event, last event, total count, discount count of apps and a list of apps per user with combined summation operators
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Application: string,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", "OfficeHome", "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", "SharePoint", "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", "OfficeHome", "cassie.hicks@contoso.com",
    "2023-07-22 08:23:53.111", "20.20.20.20", "MyPayroll", "eric.lang@contoso.com",
    "2023-07-18 17:19:41.234","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-06-13 13:23:33.761","20.20.500.20","MyPayroll","eric.lang@contoso.com",
    "2023-06-18 02:32:50.331","20.20.20.20","Teams","bill.malone@contoso.com",
    "2023-07-11 14:44:10.122","20.20.20.20","OfficeHome","eric.lang@contoso.com",
    "2023-07-16 10:11:22.255","25.20.25.20","Teams","eric.lang@contoso.com",
    "2023-07-04 00:25:29.499","20.20.20.20","OfficeHome","bill.malone@contoso.com"
];
Log
| summarize FirstEvent=min(Timestamp),LastEvent=max(Timestamp),TotalCount=count(), DistinctApps=dcount(Application), ListOfApps=make_set(Application) by User
```

##### Example log data to understand data manipulation
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
```

##### Selecting only certain columns with project 
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
| project Timestamp, IPAddress, User
```

##### Renaming columns during a project 
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
| project TimeGenerated=Timestamp, IPAddr=IPAddress, UserPrincipalName=User
```

##### Using project to create new calculated columns
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
| project TimeGenerated=Timestamp, IPAddr=IPAddress, UserPrincipalName=User, DaysFromToday=datetime_diff("day",now(),Timestamp)
```

##### Example log data to understand extend
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
```

##### Extending JSON nested fields into new fields
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
| extend City = tostring(Location.City)
| extend Country = tostring(Location.Country)
```

##### Example log data to understand parse
```KQL
let Log=datatable (data: string)["datetime=2023-07-08 23:00:00,SrcIP=10.10.10.10,DstIP=50.50.50.50,Port=3389"];
Log
```

##### Parsing destination IP to a new field
```KQL
let Log=datatable (data: string)["datetime=2023-07-08 23:00:00,SrcIP=10.10.10.10,DstIP=50.50.50.50,Port=3389"];
Log
| parse data with * @"DstIP=" DestinationIP @"," *
```

##### Changing the parse and making an error
```KQL
let Log=datatable (data: string)["datetime=2023-07-08 23:00:00,SrcIP=10.10.10.10,DstIP=50.50.50.50,Port=3389"];
Log
| parse data with * @"DstIP=" DestinationIP @"=" *
```

##### Parsing all fields to new columns
```KQL
let Log=datatable (data: string)["datetime=2023-07-08 23:00:00,SrcIP=10.10.10.10,DstIP=50.50.50.50,Port=3389"];
Log
| parse data with * @"datetime=" Timestamp @",SrcIP=" SourceIP @",DstIP=" DestinationIP @",Port=" Port
```

##### Splitting data into new fields
```KQL
let Log=datatable (data: string)["datetime=2023-07-08 23:00:00,SrcIP=10.10.10.10,DstIP=50.50.50.50,Port=3389"];
Log
| extend SplitData=split(data,",")
```

##### Changing the split and making an error
```KQL
let Log=datatable (data: string)["datetime=2023-07-08 23:00:00,SrcIP=10.10.10.10,DstIP=50.50.50.50,Port=3389"];
Log
| extend SplitData=split(data,"=")
```

##### Sample data to show trim
```KQL
let Log=datatable (data: string)["==cassie.hicks@contoso.com=="];
Log
```

##### Trimming data 
```KQL
let Log=datatable (data: string)["==cassie.hicks@contoso.com=="];
Log
| extend TrimmedData=trim("==",data)
```

##### Sample data to understand the let operator
```KQL
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
```

##### Setting IP addresses as a variable using let
```KQL
let IPs=dynamic(["20.20.20.20","20.70.20.20"]);
let Log=datatable (
    Timestamp: datetime,
    IPAddress: string,
    Location: dynamic ,
    User: string
)[
    "2023-07-18 07:23:24.299", "20.20.20.20", dynamic({"Country":"US", "City":"New York"}), "eric.lang@contoso.com",
    "2023-07-20 14:54:44.343", "50.20.500.20", dynamic({"Country":"UK", "City":"London"}), "eric.lang@contoso.com",
    "2023-06-13 09:53:12.123", "20.70.20.20", dynamic({"Country":"AU", "City":"Sydney"}), "cassie.hicks@contoso.com"
];
Log
| where IPAddress in (IPs)
```

##### Looking for malware.exe - hypothetical, no test data available
```KQL
DeviceFileEvents
| where ActionType == "FileCreated"
| where FileName == "malware.exe"
```

##### Casting query results as a variable using let to use in an additional query
```KQL
let devices=
DeviceFileEvents
| where ActionType == "FileCreated"
| where FileName == "malware.exe"
| distinct DeviceName;
DeviceLogonEvents
| where DeviceName in (devices)
```

##### Returning CVE data from CISA using externaldata
```KQL
let CISAVulns=
externaldata(cveID: string, vendorProject: string, product: string, vulnerabilityName: string, dateAdded: datetime, shortDescription: string, requiredAction: string, dueDate: datetime, knownRansomwareCampaignUse:string,notes:string)
[
'https://www.cisa.gov/sites/default/files/csv/known_exploited_vulnerabilities.csv'
];
CISAVulns
```

##### Looking for CVE's from a specific vendor using externaldata
```KQL
let CISAVulns=
externaldata(cveID: string, vendorProject: string, product: string, vulnerabilityName: string, dateAdded: datetime, shortDescription: string, requiredAction: string, dueDate: datetime)
[
'https://www.cisa.gov/sites/default/files/csv/known_exploited_vulnerabilities.csv'
];
CISAVulns
| where vendorProject == "Adobe"
```
