## User Compromise in Microsoft 365

#### KQL queries from the User Compromise in Microsoft 365 section of chapter 5 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### The queries in this section of the book use a fictious scenario from Tailspin Toys, so you won't see any results in your environment if you run the queries directly. However if you switch in real usernames from your tenant then you can see the results of the queries in your own environment.


##### Searching for MFA prompts for Anna Lidman
```KQL
SigninLogs
| where TimeGenerated > ago (30d)
| where UserPrincipalName == “anna.lidman@tailspintoys.com”
| where ResultType == 50074
| project TimeGenerated, UserPrincipalName, AppDisplayName, ResultType, IPAddress, UserAgent, Location
```

##### Searches for MFA prompts for Anna Lidman with additional risk
```KQL
SigninLogs
| where TimeGenerated > ago (30d)
| where UserPrincipalName == "anna.lidman@tailspintoys.com"
| where ResultType == 50074
| where RiskLevelDuringSignIn != "none"
| project TimeGenerated, UserPrincipalName, AppDisplayName, ResultType, IPAddress, UserAgent, Location, RiskLevelDuringSignIn
```

##### Searches for sign ins from Anna Lidman from a malicious IP, to OfficeHome or from Nigeria
```KQL
SigninLogs
| where TimeGenerated > ago (30d)
| where UserPrincipalName == "anna.lidman@tailspintoys.com"
| where AppDisplayName == "OfficeHome" or IPAddress == "70.70.70.70" or Location == "NG"
| project TimeGenerated, UserPrincipalName, AppDisplayName, ResultType, IPAddress, UserAgent, Location, RiskLevelDuringSignIn
```

##### Summarizes sign in data from Anna Lidman from a malicious IP address
```KQL
SigninLogs
| where TimeGenerated > ago (30d)
| where UserPrincipalName == "anna.lidman@tailspintoys.com"
| where ResultType == 0
| where IPAddress == "70.70.70.70" 
| project TimeGenerated, UserPrincipalName, AppDisplayName, ResultType, IPAddress, UserAgent, Location, RiskLevelDuringSignIn
| summarize TotalCount=count(), FirstEvent=min(TimeGenerated), LastEvent=max(TimeGenerated), AppsAccessed=make_set(AppDisplayName)
```

##### Summarizes sign in data from all users from a malicious IP address
```KQL
SigninLogs
| where TimeGenerated > ago (30d)
| where ResultType == 0
| where IPAddress == "70.70.70.70" 
| project TimeGenerated, UserPrincipalName, AppDisplayName, ResultType, IPAddress, UserAgent, Location, RiskLevelDuringSignIn
| summarize TotalCount=count(), FirstEvent=min(TimeGenerated), LastEvent=max(TimeGenerated), AppsAccessed=make_set(AppDisplayName) by UserPrincipalName
```

##### Searches for Microsoft Entra ID audit events from Anna Lidman or Eric Lang
```KQL
AuditLogs
| where InitiatedBy has_any ("anna.lidman@tailspintoys.com","eric.lang@tailspintoys.com") or TargetResources has_any ("anna.lidman@tailspintoys.com","eric.lang@tailspintoys.com")
| project TimeGenerated, OperationName, Result, InitiatedBy, TargetResources
```

##### Searches for Cloud App Events belonging to Anna Lidman, Eric Lang, a suspicious phone number, workstation and from a malicious IP address
```KQL
CloudAppEvents
| where TimeGenerated > ago (30d)
| where RawEventData has_any("anna.lidman@tailspintoys.com","eric.lang@tailspintoys.com","4845551234","DESKTOP-ANG80Y") and RawEventData has "70.70.70.70"


