## Creating Constants with let

#### KQL queries from the Creating Constants with let section of chapter 3 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Calculating time differences
```KQL
let startTime = datetime(2023-06-01);
let endTime = now();
let timeDiffInSeconds = (endTime - startTime) / 1s;
AppAvailabilityResults
| extend ElapsedSeconds = timeDiffInSeconds
```

##### Syntax for creating functions
```KQL
let formatFullName = (firstName:string, lastName:string) {
    strcat(firstName, " ", lastName)
};
AppAvailabilityResults
| project CountryFullName = formatFullName(ClientCity, ClientStateOrProvince)

```

##### MSFT Employee Contribution-Razi Rais
##### This KQL query, which generates insights into potential attack patterns based on a high volume of requests originating from IP Address, User Account, and other relevant factors, is exceptionally effective when executed hourly as an alert or as a part of a workbook to observe the pattern over a longer duration. The query is adaptable in that it permits you to pass column name dynamically, such as IPAddress, but modify it to another column, such as UserPrincipleName, without having to rewrite the query.
```KQL
let alertThreshold = 10.0; //Alert will be triggered when this threashold (%) will be crossed. Default is 10%
let duration = timespan(30d); //Duration (Azure Monitor only support alerts with duration looking pass data from 14 days) 
let totalRequestsWithRisk = (duration: timespan) {
    SigninLogs   
    | where TimeGenerated >= ago(duration)   
    | summarize total = count()
}; 
let eval = (columnName: string) {
    SigninLogs
    | where TimeGenerated >= ago(duration) 
    | summarize requestsSend = count() by column_ifexists(columnName, “”) 
    | project column_ifexists(columnName, “”), requestsSend    
    | extend total= toscalar(totalRequestsWithRisk(duration))    
    | extend percentage = round((toreal(requestsSend) / toreal(total)) * 100, 2)
    | where percentage > alertThreshold
    | project
        column_ifexists(columnName, “”),
        requests_send=requestsSend,
        total_requests=total,
        percentage_total = strcat(percentage, “%”),
        query_eval_window_days_hours_mins= format_timespan(duration, “d: h: m”) //days  
    | order by requests_send desc
};
eval(“UserPrincipalName”) //Can pass other column e.g. UserPrincipalName, etc
```
