## Uniting Queries with KQL Unions

#### KQL queries from the Uniting Queries with KQL Unions section of chapter 3 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Handling Columns with Different Names
```KQL
Table1
| project Name, Age

Table2
| project FullName, YearsOld

Table1 | union Table2
```

##### Filtering and Sorting Unioned Data
```KQL
Table1
| where Category == "Electronics"

Table2
| where Category == "Clothing"

(Table1 | union Table2)
| order by Price desc
```

##### Using Let Statements with Union
```KQL
let Table1 = Sales_2022 | where Region == "North"
let Table2 = Sales_2023 | where Region == "South"

(Table1 | union Table2)
| summarize sum(Revenue) by Region 
```
##### MSFT Employee Contribution-Franck Heilmann
##### For a token protection enablement in conditional access, to minimize the likelihood of user disruption due to applications or device incompatibility, we highly recommend doing staged deployment and actively monitoring the sign-in logs. This query gives administrators a per token protection conditional access rules user impact view.
```KQL
let alertThreshold = 10.0; //Alert will be triggered when this threashold (%) will be crossed. Default is 10%
let duration = timespan(30d); //Duration (Azure Monitor only support alerts with duration looking pass data from 14 days) 
let totalRequestsWithRisk = (duration: timespan) {
    SigninLogs   
    | where TimeGenerated >= ago(duration)   
    | summarize total = count()
}; 
let eval = (columnName: string) {
    SigninLogs
    | where TimeGenerated >= ago(duration) 
    | summarize requestsSend = count() by column_ifexists(columnName, “”) 
    | project column_ifexists(columnName, “”), requestsSend    
    | extend total= toscalar(totalRequestsWithRisk(duration))    
    | extend percentage = round((toreal(requestsSend) / toreal(total)) * 100, 2)
    | where percentage > alertThreshold
    | project
        column_ifexists(columnName, “”),
        requests_send=requestsSend,
        total_requests=total,
        percentage_total = strcat(percentage, “%”),
        query_eval_window_days_hours_mins= format_timespan(duration, “d: h: m”) //days  
    | order by requests_send desc
};
eval(“UserPrincipalName”) //Can pass other column e.g. UserPrincipalName, etc
```
