## The Power of Joining Data

#### KQL queries from the The Power of Joining Data section of chapter 3 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Joining Tables with the Innerunique Flavor 
```KQL
let Fruit = datatable(number:int, fruit:string) 
[
    1, "Apple",
    1, "Pear"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice"
];
Fruit
| join kind=innerunique Preparation on number
```

##### Exploring the Inner Join Flavor 
```KQL
let Fruit = datatable(number:int, fruit:string) 
[
    1, "Apple",
    1, "Pear"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice"
];
Fruit
| join kind=inner Preparation on number
```

##### Unleashing the Power of Leftouter Join 
```KQL
let Fruit = datatable(number:int, fruit:string)
[
    1, "Apple",
    2, "Pear"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice",
    2, "Juice"
];
Fruit
| join kind=leftouter Preparation on number 
```

##### Going Beyond with Rightouter Join  
```KQL
let Fruit = datatable(number:int, fruit:string)
[
    1, "Apple",
    2, "Pear",
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    2, "Juice",
    3, "Dry"
];
Fruit
| join kind=rightouter Preparation on number
```

##### The Complete Picture with Fullouter Join  
```KQL
let Fruit = datatable(number:int, fruit:string)
[
    1, "Apple",
    2, "Pear",
    4, "Banana"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice",
    2, "Juice",
    3, "Dry"
];
Fruit
| join kind=fullouter Preparation on number
```

##### Simplifying with Leftsemi Join   
```KQL
let Fruit = datatable(number:int, fruit:string)
[
    1, "Apple",
    2, "Pear",
    4, "Banana"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice",
    2, "Juice",
    3, "Dry"
];
Fruit
| join kind=leftsemi Preparation on number
```

##### Finding Matches with Rightsemi Join    
```KQL
let Fruit = datatable(number:int, fruit:string)
[
    1, "Apple",
    2, "Pear",
    4, "Banana"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice",
    2, "Juice",
    3, "Dry"
];
Fruit
| join kind=rightsemi Preparation on number
```

##### Excluding Matches with Leftanti Join    
```KQL
let Fruit = datatable(number:int, fruit:string)
[
    1, "Apple",
    2, "Pear",
    4, "Banana"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice",
    2, "Juice",
    3, "Dry"
];
Fruit
| join kind=leftanti Preparation on number
```

##### Filtering Matches with Rightanti Join     
```KQL
let Fruit = datatable(number:int, fruit:string)
[
    1, "Apple",
    2, "Pear",
    4, "Banana"
];
let Preparation = datatable(number:int, preparation:string)
[
    1, "Slices",
    1, "Juice",
    2, "Juice",
    3, "Dry"
];
Fruit
| join kind=rightanti Preparation on number
```

##### MSFT Employee Contribution-Kristopher Bash
##### Microsoft Graph Activity Logs include an identifier field (SignInActivityId) which can be used to join the logs with SignInLogs. SignInLogs provide detail of the authentication request. By joining these tables, you can explore token issuance and usage of the token. As SignInLogs are split into multiple log categories/tables, a more comprehensive join benefits from union of the SignInLogs tables before joining.
```KQL
MicrosoftGraphActivityLogs 
| where TimeGenerated > ago(3d) 
| where SignInActivityId == 'tPcQvrtP4kirTjs98vmiAA' 
| join kind=leftouter (union SigninLogs, AADNonInteractiveUserSignInLogs, AADServicePrincipalSignInLogs, AADManagedIdentitySignInLogs 
    | where TimeGenerated > ago(4d) 
    | summarize arg_max(TimeGenerated, *) by UniqueTokenIdentifier 
    ) 
    on $left.SignInActivityId == $right.UniqueTokenIdentifier 
| limit 100
```

##### MSFT Employee Contribution-Jack Davis
##### Helpful in evaluating where Single-Factor Authentication has been used to successfully sign into Intune-managed Entra ID Joined (AADJ) Windows endpoints by users not identified as the Primary User of those endpoints.
```KQL
let dc = IntuneDevices 
| extend entra_DeviceID = tostring(ReferenceId); 
let entraIDsignin = SigninLogs 
| extend entra_DeviceID = tostring(DeviceDetail.deviceId); 
entraIDsignin 
| join kind=inner dc on entra_DeviceID 
| extend authenticationMethod_ = tostring(parse_json(AuthenticationDetails)[0].authenticationMethod) 
| extend succeeded_ = tostring(parse_json(AuthenticationDetails)[0].succeeded) 
| extend IntuneDeviceID = DeviceId 
| extend trustType_ = tostring(DeviceDetail.trustType) 
| where trustType_ == 'Azure AD joined' 
| where ManagedBy == 'Intune' 
| where Resource == "Microsoft.aadiam" and AppDisplayName == "Windows Sign In" 
| where succeeded_ == 'true' 
| where authenticationMethod_== "Password" and succeeded_ == "true" 
| where AuthenticationRequirement == 'singleFactorAuthentication' 
| where PrimaryUser != UserId 
| summarize logins=count() by UserPrincipalName, IntuneDeviceID 
| render columnchart
```