## Hands-on Training: Mastering KQL

#### KQL queries from the Hands-on Training: Mastering KQL section of chapter 4 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Case Study 1: Detecting and Mitigating Security Threats Using Advanced Hunting
```KQL
// KQL query to detect and mitigate security threats using advanced hunting
let starttime = ago(7d);
let endtime = now();
let AnomalousLogonEvents = 
    SigninLogs
    | where TimeGenerated between (starttime .. endtime)
    | where ResultType !in ("0", "50125", "50140")
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by bin(TimeGenerated, 1h), IPAddress, UserPrincipalName, ResultType, ResultDescription
    | project-away count_
    | join kind=inner (
        SigninLogs
        | where TimeGenerated between (starttime .. endtime)
        | where ResultType in ("0", "50125", "50140")
        | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by bin(TimeGenerated, 1h), IPAddress, UserPrincipalName, ResultType, ResultDescription
        | project-away count_
    ) on IPAddress, UserPrincipalName
    | where StartTime < StartTime1
    | project StartTime, EndTime, IPAddress, UserPrincipalName, ResultType, ResultDescription;
AnomalousLogonEvents
```

##### Case Study 2: Securing Cloud Infrastructure with KQL
```KQL
// KQL query to secure cloud infrastructure
let starttime = ago(7d);
let endtime = now();
let SecurityMisconfigurations = 
    SecurityEvent
    | where TimeGenerated between (starttime .. endtime)
    | where EventID == 4688
    | where CommandLine contains "misconfigurations"
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by bin(TimeGenerated, 1h), Computer, Account, CommandLine
    | project-away count_
    | join kind=inner (
        SecurityEvent
        | where TimeGenerated between (starttime .. endtime)
        | where EventID == 4688
        | where CommandLine contains "vulnerabilities"
        | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by bin(TimeGenerated, 1h), Computer, Account, CommandLine
        | project-away count_
    ) on Computer, Account
    | where StartTime < StartTime1
    | project StartTime, EndTime, Computer, Account, CommandLine;
SecurityMisconfigurations
```

##### Case Study 3: Improving Incident Response with KQL
```KQL
// KQL query to secure cloud infrastructure
let timeframe = ago(30d);
SecurityAlert
| where TimeGenerated >= timeframe
| summarize count() by AlertName, bin(TimeGenerated, 1d)
| render timechart
```

##### MSFT Employee Contribution-Gloria Lee
##### Sudden changes from normal behavior can indicate an issue that needs to be investigated. The first query looks for detect increasing failure rates. As necessary, you can adjust the ratio at the bottom. It represents the percent change in traffic in the last hour as compared to yesterday's traffic at same time. A 0.5 result indicates a 50% difference in the traffic. The second query we are looking for drops of application usage. we compare traffic in the last hour to yesterday's traffic at the same time. We exclude Saturday, Sunday, and Monday because we expect large variability in the previous day's traffic at the same time. Once again adjust these values to fit your business operations model.
```KQL
let today = SigninLogs 
| where TimeGenerated > ago(1h) // Query failure rate in the last hour  
| project TimeGenerated, UserPrincipalName, AppDisplayName, status = case(Status.errorCode == "0", "success", "failure") 
// Optionally filter by a specific application 
//| where AppDisplayName == **APP NAME** 
| summarize success = countif(status == "success"), failure = countif(status == "failure") by bin(TimeGenerated, 1h) // hourly failure rate 
| project TimeGenerated, failureRate = (failure * 1.0) / ((failure + success) * 1.0) 
| sort by TimeGenerated desc 
| serialize rowNumber = row_number(); 
let yesterday = SigninLogs 
| where TimeGenerated between((ago(1h) – totimespan(1d))..(now() – totimespan(1d))) // Query failure rate at the same time yesterday 
| project TimeGenerated, UserPrincipalName, AppDisplayName, status = case(Status.errorCode == "0", "success", "failure") 
// Optionally filter by a specific application 
//| where AppDisplayName == **APP NAME** 
| summarize success = countif(status == "success"), failure = countif(status == "failure") by bin(TimeGenerated, 1h) // hourly failure rate at same time yesterday 
| project TimeGenerated, failureRateYesterday = (failure * 1.0) / ((failure + success) * 1.0) 
| sort by TimeGenerated desc 
| serialize rowNumber = row_number(); 
today 
| join (yesterday) on rowNumber // join data from same time today and yesterday 
| project TimeGenerated, failureRate, failureRateYesterday 
// Set threshold to be the percent difference in failure rate in the last hour as compared to the same time yesterday 
// Day variable is the number of days since the previous Sunday. Optionally ignore results on Sat, Sun, and Mon because large variability in traffic is expected. 
| extend day = dayofweek(now()) 
| where day != time(6.00:00:00) // exclude Sat 
| where day != time(0.00:00:00) // exclude Sun 
| where day != time(1.00:00:00) // exclude Mon 
| where abs(failureRate – failureRateYesterday) > 0.5 
```

```KQL
Let today = SigninLogs // Query traffic in the last hour 
| where TimeGenerated > ago(1h) 
| project TimeGenerated, AppDisplayName, UserPrincipalName 
// Optionally filter by AppDisplayName to scope query to a single application 
//| where AppDisplayName contains "Office 365 Exchange Online" 
| summarize users = dcount(UserPrincipalName) by bin(TimeGenerated, 1hr) // Count distinct users in the last hour 
| sort by TimeGenerated desc 
| serialize rn = row_number(); 
let yesterday = SigninLogs // Query traffic at the same hour yesterday 
| where TimeGenerated between((ago(1h) – totimespan(1d))..(now() – totimespan(1d))) // Count distinct users in the same hour yesterday 
| project TimeGenerated, AppDisplayName, UserPrincipalName 
// Optionally filter by AppDisplayName to scope query to a single application 
//| where AppDisplayName contains "Office 365 Exchange Online" 
| summarize usersYesterday = dcount(UserPrincipalName) by bin(TimeGenerated, 1hr) 
| sort by TimeGenerated desc 
| serialize rn = row_number(); 
today 
| join // Join data from today and yesterday together 
( 
yesterday 
) 
on rn 
// Calculate the difference in number of users in the last hour compared to the same time yesterday 
| project TimeGenerated, users, usersYesterday, difference = abs(users – usersYesterday), max = max_of(users, usersYesterday) 
| extend ratio = (difference * 1.0) / max // Ratio is the percent difference in traffic in the last hour as compared to the same time yesterday 
// Day variable is the number of days since the previous Sunday. Optionally ignore results on Sat, Sun, and Mon because large variability in traffic is expected. 
| extend day = dayofweek(now()) 
| where day != time(6.00:00:00) // exclude Sat 
| where day != time(0.00:00:00) // exclude Sun 
| where day != time(1.00:00:00) // exclude Mon 
| where ratio > 0.7 // Threshold percent difference in sign-in traffic as compared to same hour yesterday 
```
