## KQL Across Azure

#### KQL queries from the KQL Across Azure section of chapter 4 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### MSFT Employee Contribution-Kristopher Bash
##### API requests that are rejected due to exhaustion of a rate-limit (i.e. throttling) show up in the logs with a ResponseStatusCode of 429. While occasional rate-limit exhaustion is not necessarily a concern, and applications are expected to pause and retry, excessive rates of 429 responses can indicate a problem in application implementation
```KQL
MicrosoftGraphActivityLogs 
| where TimeGenerated > ago(3d) 
| where ResponseStatusCode == 429 
| extend path = replace_string(replace_string(replace_regex(tostring(parse_url(RequestUri).Path), @'(\/)+','//'),'v1.0/',''),'beta/','') 
| extend UriSegments =  extract_all(@'\/([A-z2]+|\$batch)($|\/|\(|\$)',dynamic([1]),tolower(path)) 
| extend OperationResource = strcat_array(UriSegments,'/')| summarize RateLimitedCount=count() by AppId, OperationResource, RequestMethod 
| sort by RateLimitedCount desc 
| limit 100
```
