## Using KQL to Create Powerful Azure Monitor Workbooks

#### KQL queries from the Using KQL to Create Powerful Azure Monitor Workbooks section of chapter 4 are found below

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required


##### Retrieve security events and parses XML data
```KQL
SecurityEvent
| extend Details = parse_xml(EventData)
| extend FilePath = tostring(Details.UserData.RuleAndFileData.FilePath)
| extend FileHash = tostring(Details.UserData.RuleAndFileData.FileHash)
| where FileHash != "" and FilePath !startswith "%SYSTEM32"
| summarize count() by FileHash, FilePath
```

##### Filtering columns that are physically present in the dataset rather than filtering evaluated columns 1
```KQL
Syslog
| extend Msg = strcat("Syslog: ",SyslogMessage)
| where  Msg  has "Error"
| count
```

##### Filtering columns that are physically present in the dataset rather than filtering evaluated columns 2
```KQL
Syslog
| where  SyslogMessage  has "Error"
| count
```

##### Establish a connection to a Log Analytics workspace named "Mktlogs" and retrieve data from the "AppServiceHTTPLogs" table
```KQL
= Kusto.Contents("https://ade.loganalytics.io/subscriptions/4d72480d-0adb-4df7-b5e3-866c027fe3e0/resourcegroups/marketing/providers/microsoft.operationalinsights/workspaces/Mktlogs", "Mktlogs", "AppServiceHTTPLogs", [MaxRows=null, MaxSize=null, NoTruncate=null, AdditionalSetStatements=null])
```

