## Advanced KQL for Cyber Security 

#### KQL queries from the joins section of Advanced KQL for Cyber Security are found here

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required

### Example threat intelligence data to use for joins
```KQL
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true)
```

### Example firewall data to use for joins
```KQL
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true)
```

### Casting our data as variables
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
```

### Example of an inner join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=inner(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

### Adding additional filters to our inner join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| where Confidence == "high"
| join kind=inner(
fwlogs
| where Action == "allow"
) 
on $left.Indicator==$right.DestinationIP
```

### Example of a fullouter join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=fullouter(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

##### MSFT Employee Contribution-Yong Rhee
##### Full outer joins can be useful for reporting, where you want the full set of data across all combined tables, such as reporting on antimalware signature, engine and platform versions in Microsoft Defender for Endpoint.
```KQL
let StartDate = ago(30d);
DeviceFileEvents 
| where Timestamp > StartDate
| where InitiatingProcessFileName =~ 'MpSigStub.exe' and InitiatingProcessCommandLine contains '/stub' and InitiatingProcessCommandLine contains '/payload'
| summarize Timestamp = arg_max(Timestamp, InitiatingProcessCommandLine) by DeviceId, DeviceName
| extend SplitCommand = split(InitiatingProcessCommandLine, ' ')
| extend EngineVersionLocation = array_index_of(SplitCommand, "/stub") + 1, DefinitionVersionLocation = array_index_of(SplitCommand, "/payload") + 1
| project Timestamp, DeviceName, DeviceId, AMEngineVersion = SplitCommand[EngineVersionLocation], AntivirusSignatureVersion = SplitCommand[DefinitionVersionLocation]
| join kind=fullouter (
    DeviceProcessEvents
    | where Timestamp > StartDate
    | where FileName =~ 'MsMpEng.exe' and FolderPath contains @"\Microsoft\Windows Defender\Platform\"
    | summarize arg_max(Timestamp, FolderPath) by DeviceId, DeviceName
    | project DeviceId, DeviceName, AMServiceVersion = split(FolderPath, '\\')[-2]
) on DeviceId
| project DeviceId, DeviceName, AMEngineVersion, AntivirusSignatureVersion, AMServiceVersion
```

### Example of a fullouter join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=leftouter(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

### Example of a leftanti join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=leftanti(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

### Example of a leftsemi join
```KQL
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=leftsemi(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

### Example of a rihghtouter join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=rightouter(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

### Example of a rightnait join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=rightanti(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

### Example of a rightsemi join
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=rightsemi(
fwlogs
) 
on $left.Indicator==$right.DestinationIP
```

### Example of an inner join on two fields
```KQL
let indicators=
externaldata (Indicator:string,Location:string,FirstSeen:datetime,Confidence:string,TrafficType:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/Indicators.csv'] with (ignorefirstrecord=true);
let fwlogs=
externaldata (Timestamp:datetime,SourceIP:string,DestinationIP:string,Direction:string,Port:string,Action:string) [
h@'https://raw.githubusercontent.com/KQLMSPress/definitive-guide-kql/main/Chapter%206%3A%20Advanced%20KQL%20for%20Cyber%20Security/Data%20Samples/FWLogs.csv'] with (ignorefirstrecord=true);
indicators
| join kind=inner(
fwlogs
) 
on $left.Indicator==$right.DestinationIP, $left.TrafficType==$right.Port
```

##### MSFT Employee Contribution-Michael Barbush
##### Joining data between tables provides interesting detection capabilities, for instance you can combine filename data and certificate information to detect where a filename may have been changed to evade detection
```KQL
DeviceFileEvents 
| where InitiatingProcessFileName has_any ("any.exe") and isnotempty(InitiatingProcessSHA1) and Timestamp > ago(24h) 
| summarize by strangefiles=InitiatingProcessSHA1 
| join kind=inner(DeviceFileCertificateInfo 
| where isnotempty(IsTrusted)) on $left.strangefiles == $right.SHA1 
| summarize by strangefiles, Signer, Issuer, IsSigned, IsTrusted 
```

### Example of joining on multiple tables
```KQL
EmailEvents
| join kind=inner(EmailUrlInfo) on NetworkMessageId
| join kind=inner(UrlClickEvents) on Url, NetworkMessageId

```
