## Advanced KQL for Cyber Security 

#### KQL queries from the iff, case and coalesce section of Advanced KQL for Cyber Security are found here

#### Use the copy option (to the right of each code box) to copy the query to paste into your own environment

#### Some queries use example data, or are based on hyopthetical scenarios, and you should switch in relevant data to your environment if required

### Device info data to be used with iff()
```KQL
DeviceInfo
| project DeviceName, OSPlatform, OSDistribution
```

### Using iff() to add context to a query
```KQL
DeviceInfo
| project DeviceName, OSPlatform, OSDistribution
| extend isWindows = iff(OSPlatform contains "Windows","true","false")
| extend isServer = iff(OSDistribution contains "Server","true","false")
```

### Using case() to add guest user logic
```KQL
SigninLogs
| where TimeGenerated > ago (1d)
| where UserType == "Guest"
| project TimeGenerated, UserPrincipalName, AppDisplayName, ResultType, IPAddress, HomeTenantId, ResourceTenantId, AADTenantId
| extend ['Guest Type']=case(AADTenantId != HomeTenantId and HomeTenantId != ResourceTenantId, strcat("Inbound Guest"),
                             AADTenantId == HomeTenantId and ResourceTenantId != AADTenantId, strcat("Outbound Guest"),
"unknown")
```

### Using case() to add group membership logic to Security Events
```KQL
    SecurityEvent
    | project TimeGenerated, EventID, AccountType, MemberName, SubjectUserName, TargetUserName
    | where AccountType == "User"
    | where EventID in (4728, 4729, 4732, 4733, 4756, 4757)
    | extend Action = case(EventID in ("4728", "4756", "4732"), strcat("Group Add"),
        EventID in ("4729", "4757", "4733"), strcat("Group Remove")
, "unknown")
```

### Sample data to use with coalesce()
```KQL
datatable (action:string,username:string,userdisplayname:string) [
"create virtual machine","eric.lang@tailspintoys.com","Eric Lang",
"delete virtual network","randy.byrne@tailspintoys.com","Randy Byrne",
"create storage account","","Tim Kim",
"delete storage account","dennis.bye@tailspintoys.com","",
"create virtual firewall","","Dennis Bye"
]
```

### Using coalesce() to combine fields
```KQL
datatable (action:string,username:string,userdisplayname:string) [
"create virtual machine","eric.lang@tailspintoys.com","Eric Lang",
"delete virtual network","randy.byrne@tailspintoys.com","Randy Byrne",
"create storage account","","Tim Kim",
"delete storage account","dennis.bye@tailspintoys.com","",
"create virtual firewall","","Dennis Bye"
]
| extend Actor=coalesce(username, userdisplayname)
```
